{"podcast_details": {"podcast_title": "This Day in History Class", "episode_title": "Helium is discovered during a solar eclipse - August 18th, 1868", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/c69b2897-f832-4512-8495-ae320005ba73/image.jpg?t=1684789617&size=Large", "episode_transcript": " With so many streaming devices out there today, what sets Roku apart? Roku players are made for one thing, to get you the entertainment you want quick and easy. That means a simple home screen with your favorites front and center, channels like iHeartRadio that launch in a snap, and curated selections of TV for when you only sorta know what to watch. Not to mention all the free TV you can stream, including over 300 free live channels on the Roku channel. Find the perfect Roku player for you today at Roku.com. Happy streaming! If you're looking to level up your dorm room entertainment game, then drop into this A Plus TV deal. For a limited time, you can get a 50-inch 4K V-Series Vizio Smart TV for just $268. Enjoy stunning picture quality and dramatic 4K details for all your movie nights. Plus, access the selection of over 175 premium apps that come built in, such as the iHeartRadio app for all your favorite music and podcasts. This TV has your back-to-college entertainment covered. Get yours before they sell out at Walmart.com. This Day in History class is a production of iHeartRadio. Hello and welcome to This Day in History Class, a show that discovers something new about history every day of the week. I'm Gabe Lussier, and in this episode, we're talking about the day when mankind first encountered helium. The noble gas that adds lift to our balloons gives us squeaky voices and keeps the Large Hadron Collider from exploding. The day was August 18, 1868. French astronomer Pierre Jules César Janssen discovered an unknown element while observing a solar eclipse. What he saw later turned out to be helium, the first extraterrestrial element ever discovered, as it had never been found before on Earth. The mid-19th century was an exciting time for the field of astronomy. In 1859, for example, German researchers Gustav Kerchhoff and Robert Bunsen worked out a way to determine the composition of heavenly bodies. They discovered that heating different elements produced bright lines of light, which were visible through a spectroscope, a kind of prism that disperses light into measurable wavelengths. The scientists also learned that each element produces its own unique spectrum, which meant that if they turned their spectroscope skyward, they'd be able to identify the elemental makeup of the sun and stars based on the lines of light they emitted. After this breakthrough, Janssen and his fellow stargazers threw themselves headfirst into this new form of light analysis. Although he lived in Paris, Janssen traveled all over Europe and Asia, hunting down the best positions from which to observe the night sky. He also chased after solar eclipses, as those events provided the rare chance to study the colorful, flame-like bursts that emanated from the sun, something we now know to be hot clouds of dense gas called solar prominences. At the time, scientists thought the spectrum of the sun could only be observed during an eclipse, so to make the most of this seemingly rare opportunity, Janssen would travel to a spot within the eclipse's narrow path of totality so that he'd have the best vantage point possible. His quest took him to Italy in February of 1867, and then the following summer, he traveled all the way to Gunter, India to witness that year's solar eclipse. Both of those expeditions were funded by the French government and its National Academy of Sciences, at a cost of more than 70,000 francs total. Thankfully, on the morning of August 18, 1868, the nation's investment paid off. Janssen watched as the moon passed in front of the sun and revealed the solar prominences that were otherwise invisible to the human eye. He noticed, as did many others that day, that the glowing emissions were mostly composed of super-hot hydrogen gas. However, Janssen also spotted something that most others overlooked. While looking through his spectroscope, he realized there was a line of yellow light that didn't correspond to the wavelength of any known element. It came closest to that of sodium, but was different enough to warrant further investigation. According to the science of his day, that investigation would have to wait until the next solar eclipse, but Janssen wasn't so sure. He thought that the mysterious line might be bright enough to be viewed even without the aid of an eclipse, so long as you had a way to filter out all the other wavelengths of visible light. Janssen's hypothesis would later bear fruit in the form of the spectro-helioscope, a special telescope dedicated to examining the spectrum of the sun. Janssen didn't know it, but some 5,000 miles away, English astronomer Joseph Norman Lockyer had reached the same conclusion. In fact, the two scientists each wrote a paper detailing their observations, and in a strange twist, both of them arrived at the French Academy of Sciences on the same day. The papers overlapped on nearly every point, including descriptions of the mysterious yellow light and of how to view the sun without an eclipse. The synchronicity of the two reports posed a problem for the Academy, namely, they didn't know who to credit for the discovery, because although Janssen had made his observations first, on August 18th, both men's work was made public on the same later date. Faced with an impossible choice, fellow astronomer Hervé Fay suggested a compromise. Instead of trying to proportion the merit of the discovery and consequently diminishing it, he said, would it be better to attribute impartially the whole honor to both of these men of science, who, separated by some thousands of miles, have each been fortunate enough to reach the intangible and invisible by a method which is probably the most astonishing that the genius of observation has ever conceived. Janssen and Lockyer thought that would be better, and agreed to share credit for the discovery. There was still a big lingering question, though. What exactly had they discovered? The most straightforward explanation was that the yellow light represented a new unknown element, one that hadn't yet been found on Earth. But at the time, many scientists found that hard to believe, and since they didn't have spectro-helioscopes of their own to see the evidence themselves, they assumed it wasn't true. Lockyer ignored the naysayers, asserting that he had indeed helped discover a new element, and that he believed it could also exist on Earth. He even went so far as to name it, calling it Helium, after the Greek name for the sun, Helios. Some members of the scientific community ridiculed Lockyer and Janssen for their so-called discovery. Others believed them, but thought that Helium could exist only in space. There were several efforts to recreate the element in a lab, most notably those of English chemist Edward Franklin, but every attempt ended in failure. Finally, though, in 1882, Helium was discovered on Earth by the Italian physicist Luigi Palmieri. While analyzing lava from Mount Vesuvius, he heated up the gas inside a chunk of uranium ore, and observed the unmistakable yellow spectral line of Helium. Twelve years after that, the Scottish chemist William Ramsay further experimented with the gas, and found definitive proof that Helium occurs naturally on Earth. Janssen and Lockyer were finally vindicated, and mankind officially had a new element to play with. Today, Helium is best known as the gas that fills balloons and makes your voice sound funny at parties, but it actually has several important applications that have nothing to do with your birthday. For example, Helium is often used in airbags, as it's non-toxic, non-flammable, and has a high expansion rate. Another useful attribute of Helium is that its liquid state has the lowest boiling point of any material on the planet. Not only does that make Helium invaluable to cryogenics, it also makes it uniquely suited as a coolant for everything from the magnets in an MRI scanner to the LCD screen on your phone or TV. The only real downside to Helium is that it isn't very easy to access. Earth's supply of the gas is generated deep underground through the natural radioactive decay of heavy elements, such as uranium and thorium. That means that even though Helium is the second most abundant element in the known universe after hydrogen, it's still relatively rare on Earth. So rare, in fact, that Pierre Janssen had to look way out in space just to find it. I'm Gabe Luzier, and hopefully you now know a little more about history today than you did yesterday. You can learn even more about history by following us on Twitter, Facebook, and Instagram at TDIHCShow. And if you have any comments or suggestions you'd like to share, you can pass them along by writing to thisday at iHeartMedia.com. Thanks to Chandler Mays for producing the show, and thank you for listening. I'll see you back here again soon for another day in history class. TV's are smart nowadays, but with busy home screens and remotes with too many or too few buttons, smart shouldn't mean complicated. That's why Roku TV is the smart TV made easy. The customizable home screen puts your inputs, streaming favorites like iHeart, and free live TV into your home. And you can see how the home TV works. It's a very convenient way to control your home TV. TV made easy. The customizable home screen puts your inputs, streaming favorites like iHeart and free live TV all in one place. From simple settings anyone can understand, automatic updates with the latest features, and much more, Roku TV is more than a smart TV. It's a better TV. Learn more today at Roku.com. Happy streaming! CuriosityStream is the streaming service for people who want to know more. And now check out Curiosity's new series, The Real Wild West. Rolling Stone Magazine says it's the history of the West they usually don't teach you. The mythology of the West left out a lot of the people. People say they've never seen a black cowboy. This is the history book, but did you know about these other facts? Watch The Real Wild West now on CuriosityStream. With monthly annual and bundled plans, find the one that works for you at CuriosityStream.com. Are you the kind of student who's all in until lights out? Then you're going to love this best-in-class soundbar deal. The Vizio V-Series All-in-One Soundbar is now on sale for just $99. Whether you're blasting your favorite tracks or podcasts on the iHeart radio app or taking your TV's audio to the next level, you can do it all for less than $100 with Vizio, America's number one soundbar brand. And with its space-saving design, this soundbar is 100% dorm room ready for a complete entertainment experience. Get yours now at Walmart and Walmart.com."}, "podcast_summary": "Roku is a streaming device that offers a simple and quick way to access the entertainment you want. It has a user-friendly home screen with easy access to your favorite channels and curated TV selections. Additionally, Roku provides over 300 free live channels for streaming. If you're looking to enhance your dorm room entertainment, there is a limited-time offer of a 50-inch 4K Vizio Smart TV for $268. This TV provides stunning picture quality, built-in premium apps, and entertainment options. In history, on August 18, 1868, French astronomer Pierre Jules César Janssen discovered helium, the first extraterrestrial element ever found. Helium has various applications, such as filling balloons, airbags, and serving as a coolant for technology. Although helium is abundant in the universe, it is relatively rare on Earth.", "podcast_guest": "Pierre Jules César Janssen (22 February 1824 – 23 December 1907), usually known as Jules Janssen, was a French astronomer who, along with English scientist Joseph Norman Lockyer, is credited with discovering the gaseous nature of the solar chromosphere, and with some justification the element helium.\n\n", "podcast_highlights": "- Roku players are designed to provide quick and easy access to entertainment.\n- Roku offers a simple home screen with favorite channels, quick launching apps, and curated TV selections.\n- Roku provides over 300 free live channels on the Roku channel.\n- There is a limited-time deal on a 50-inch 4K V-Series Vizio Smart TV for $268 at Walmart.com.\n- The discovery of helium by French astronomer Pierre Jules César Janssen on August 18, 1868, during a solar eclipse.\n- Janssen observed a yellow line of light in the sun's spectrum that didn't correspond to any known element.\n- Janssen, along with English astronomer Joseph Norman Lockyer, each wrote papers on their observations, which were presented on the same day.\n- The discovery led to the identification of helium as the first extraterrestrial element.\n- Helium was later discovered on Earth by Italian physicist Luigi Palmieri in 1882.\n- Helium is used in airbags, cryogenics, and as a coolant for various devices.\n- Earth's supply of helium is rare and generated through the natural decay of heavy elements."}